In [5]:
import numpy as np
import pandas as pd
pd.__version__  # 查看版本

'1.1.3'

https://www.runoob.com/pandas/pandas-series.html

## 1. pandas data structure 创建对象

### 1.1 pandas.Series( data, index, dtype, name, copy)

可以通过传递一个list对象来创建一个Series，pandas 会默认创建整型索引

### pd.Series(list)

In [6]:
a = [1, 2, 3]

s = pd.Series(a)

print(s)

0    1
1    2
2    3
dtype: int64

In [7]:
a = ["Google", "Runoob", "Wiki"] #更改index

s = pd.Series(a, index = ["x", "y", "z"])

print(s)
print(s['y'])

x    Google
y    Runoob
z      Wiki
dtype: object
Runoob

In [8]:
sites = {1: "Google", 2: "Runoob", 3: "Wiki"} #使用字典创建

myvar = pd.Series(sites, index = [1, 2])

print(myvar)

1    Google
2    Runoob
dtype: object

### 1.2 pandas.DataFrame( data, index, columns, dtype, copy)

通过传递一个 numpyarray，时间索引以及列标签来创建一个DataFrame：

In [9]:
data = [['Google',10],['Runoob',12],['Wiki',13]] ##使用列表创建

df = pd.DataFrame(data, columns = ['Site','Age'], dtype=float)

print(df)

     Site   Age
0  Google  10.0
1  Runoob  12.0
2    Wiki  13.0

In [10]:
data = {'Site':['Google', 'Runoob', 'Wiki'], 'Age':[10, 12, 13]} #使用ndarary创建

df = pd.DataFrame(data)

print (df)

     Site  Age
0  Google   10
1  Runoob   12
2    Wiki   13

In [11]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}] #使用字典创建

df = pd.DataFrame(data)

print (df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

## 2. Pandas CSV 文件

In [12]:
df = pd.read_csv('nba.csv')

print(df)

              Name            Team  Number Position   Age Height  Weight  \
0    Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1      Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2     John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3      R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4    Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
..             ...             ...     ...      ...   ...    ...     ...
453   Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0
454      Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0
455   Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0
456    Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0
457            NaN             NaN     NaN      NaN   NaN    NaN     NaN

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0
457                NaN        NaN

[458 rows x 9 columns]

#### 我们也可以使用 to_csv() 方法将 DataFrame 存储为 csv 文件：

In [13]:
   
# # 三个字段 name, site, age
# nme = ["Google", "Runoob", "Taobao", "Wiki"]
# st = ["www.google.com", "www.runoob.com", "www.taobao.com", "www.wikipedia.org"]
# ag = [90, 40, 80, 98]
   
# # 字典
# dict = {'name': nme, 'site': st, 'age': ag}
     
# df = pd.DataFrame(dict)
 
# # 保存 dataframe
# df.to_csv('site.csv')

# df2 = pd.read_csv('site.csv')
# print(df2)

### 数据处理

In [14]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [15]:
df.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [16]:
df.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

# Pandas 常用操作

## 1. 数据处理三板斧——map、apply、applymap详解 https://zhuanlan.zhihu.com/p/100064394
 
## 2. Pandas数据分析——超好用的Groupby详解 https://zhuanlan.zhihu.com/p/101284491

## 3. Pandas教程 | Merge数据合并图文详解 https://zhuanlan.zhihu.com/p/102274476

## 3(后). Pandas数据处理——玩转时间序列数据 https://zhuanlan.zhihu.com/p/106675563

## 4. Pandas数据处理——盘点那些常用的函数（上）https://zhuanlan.zhihu.com/p/106722583

## 5. Pandas数据处理——盘点那些常用的函数（下）https://zhuanlan.zhihu.com/p/106724730

## 6(后). 天秀！Pandas还能用来写爬虫？https://zhuanlan.zhihu.com/p/122361747

## 7(后). 提高数据的颜值！一起看看Pandas中的那些Style https://zhuanlan.zhihu.com/p/126223075

## 8(后). 提速百倍的Pandas性能优化方法，让你的Pandas飞起来！https://zhuanlan.zhihu.com/p/97012199

## 1. 数据处理三板斧——map、apply、applymap详解 https://zhuanlan.zhihu.com/p/100064394

In [64]:
boolean=[True,False]
gender=["male","female"]
color=["white","black","yellow"]
data=pd.DataFrame({
    "height":np.random.randint(150,190,100),
    "weight":np.random.randint(40,90,100),
    "smoker":[boolean[x] for x in np.random.randint(0,2,100)],
    "gender":[gender[x] for x in np.random.randint(0,2,100)],
    "age":np.random.randint(15,90,100),
    "color":[color[x] for x in np.random.randint(0,len(color),100) ]
}
)
print(data)

    height  weight  smoker  gender  age   color
0      152      48    True  female   45   black
1      186      78   False    male   33   white
2      167      84   False  female   57   black
3      182      63    True    male   31   black
4      158      66   False    male   43   white
..     ...     ...     ...     ...  ...     ...
95     167      81    True    male   79   white
96     153      75    True  female   26  yellow
97     151      79    True    male   63   black
98     162      40   False    male   27  yellow
99     180      65   False  female   71  yellow

[100 rows x 6 columns]

## 1.1  map用法

In [65]:
#①使用字典进行映射
data["gender"] = data["gender"].map({"male": 1, "female":0})

# #②使用函数
# def gender_map(x):
#     gender = 1 if x == "male" else 0
#     return gender
# #注意这里传入的是函数名，不带括号
# data["gender"] = data["gender"].map(gender_map)

print(data)

    height  weight  smoker  gender  age   color
0      152      48    True       0   45   black
1      186      78   False       1   33   white
2      167      84   False       0   57   black
3      182      63    True       1   31   black
4      158      66   False       1   43   white
..     ...     ...     ...     ...  ...     ...
95     167      81    True       1   79   white
96     153      75    True       0   26  yellow
97     151      79    True       1   63   black
98     162      40   False       1   27  yellow
99     180      65   False       0   71  yellow

[100 rows x 6 columns]

## 1.2 apply用法

axis=0代表操作对列columns进行，axis=1代表操作对行row进行

In [66]:
#沿着0轴求和
data[["height","weight","age"]].apply(np.sum, axis=0)

# # 沿着0轴取对数
# data[["height","weight","age"]].apply(np.log, axis=0)

height    16923
weight     6467
age        4931
dtype: int64

In [67]:
print(data)

    height  weight  smoker  gender  age   color
0      152      48    True       0   45   black
1      186      78   False       1   33   white
2      167      84   False       0   57   black
3      182      63    True       1   31   black
4      158      66   False       1   43   white
..     ...     ...     ...     ...  ...     ...
95     167      81    True       1   79   white
96     153      75    True       0   26  yellow
97     151      79    True       1   63   black
98     162      40   False       1   27  yellow
99     180      65   False       0   71  yellow

[100 rows x 6 columns]

In [68]:
def BMI(series):
    weight = series["weight"]
    height = series["height"]/100
    BMI = weight/height**2
    return BMI

data["BMI"] = data.apply(BMI,axis=1)
print(data)

    height  weight  smoker  gender  age   color        BMI
0      152      48    True       0   45   black  20.775623
1      186      78   False       1   33   white  22.545959
2      167      84   False       0   57   black  30.119402
3      182      63    True       1   31   black  19.019442
4      158      66   False       1   43   white  26.438071
..     ...     ...     ...     ...  ...     ...        ...
95     167      81    True       1   79   white  29.043709
96     153      75    True       0   26  yellow  32.038959
97     151      79    True       1   63   black  34.647603
98     162      40   False       1   27  yellow  15.241579
99     180      65   False       0   71  yellow  20.061728

[100 rows x 7 columns]

## 1.3 applymap

In [69]:
df = pd.DataFrame(
    {
        "A":np.random.randn(5),
        "B":np.random.randn(5),
        "C":np.random.randn(5),
        "D":np.random.randn(5),
        "E":np.random.randn(5),
    }
)
df

          A         B         C         D         E
0 -0.193753 -1.135503 -0.721785  0.729168  1.581497
1 -0.020498 -0.438857  1.308807 -0.283788  0.395601
2 -0.100556  0.621179 -0.308484  1.472416  0.376889
3  0.433075  0.632282  0.948649  0.306890 -0.319217
4 -0.702264 -0.140370 -0.848492 -0.923930  0.240187

In [70]:
#现在想将DataFrame中所有的值保留两位小数显示

df.applymap(lambda x:"%.2f" % x)

       A      B      C      D      E
0  -0.19  -1.14  -0.72   0.73   1.58
1  -0.02  -0.44   1.31  -0.28   0.40
2  -0.10   0.62  -0.31   1.47   0.38
3   0.43   0.63   0.95   0.31  -0.32
4  -0.70  -0.14  -0.85  -0.92   0.24

## 2. Pandas数据分析——超好用的Groupby详解 https://zhuanlan.zhihu.com/p/101284491

In [71]:
company=["A","B","C"]

data=pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
}
)
data

  company  salary  age
0       C      24   25
1       A      23   43
2       A      17   28
3       A      28   33
4       A      28   49
5       A      26   15
6       C       5   19
7       A      25   25
8       A       9   40
9       B      40   19

## 2.1 Groupby的基本原理

In [72]:
group = data.groupby("company")
print(group)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fd90888ef40>

In [73]:
print(list(group))

[('A',   company  salary  age
1       A      23   43
2       A      17   28
3       A      28   33
4       A      28   49
5       A      26   15
7       A      25   25
8       A       9   40), ('B',   company  salary  age
9       B      40   19), ('C',   company  salary  age
0       C      24   25
6       C       5   19)]

## 2.2 agg 聚合操作

In [74]:
data.groupby("company").agg('mean')

            salary        age
company
A        22.285714  33.285714
B        40.000000  19.000000
C        14.500000  22.000000

In [75]:
data.groupby('company').agg({'salary':'median','age':'mean'})

         salary        age
company
A          25.0  33.285714
B          40.0  19.000000
C          14.5  22.000000

In [76]:
avg_salary_dict = data.groupby('company')['salary'].mean().to_dict()
#代表员工所在的公司的平均薪水（相同公司的员工具有一样的平均薪水）

In [83]:
data['avg_salary'] = data['company'].map(avg_salary_dict)
data

  company  salary  age  avg_salary
0       C      24   25   14.500000
1       A      23   43   22.285714
2       A      17   28   22.285714
3       A      28   33   22.285714
4       A      28   49   22.285714
5       A      26   15   22.285714
6       C       5   19   14.500000
7       A      25   25   22.285714
8       A       9   40   22.285714
9       B      40   19   40.000000

## 2.3 Transform

In [81]:
# data['avg_salary'] = data.groupby('company')['salary'].transform('mean')
# data
#一句话搞定

## 2.4 Groupby vs Apply

区别是有的，但是整个实现原理是基本一致的。
两者的区别在于，对于groupby后的apply，以分组后的子DataFrame作为参数传入指定函数的，基本操作单位是DataFrame，
而之前介绍的apply的基本操作单位是Series。还是以一个案例来介绍groupby后的apply用法。

In [84]:
#需要获取各个公司年龄最大的员工的数据，
def get_oldest_staff(x):
    df = x.sort_values(by = 'age', ascending = True)
    return df.iloc[-1,:]

oldest_staff = data.groupby('company',as_index=False).apply(get_oldest_staff)
oldest_staff

  company  salary  age  avg_salary
0       A      28   49   22.285714
1       B      40   19   40.000000
2       C      24   25   14.500000

最后，关于apply的使用，这里有个小建议，虽然说apply拥有更大的灵活性，但apply的运行效率会比agg和transform更慢。所以，groupby之后能用agg和transform解决的问题还是优先使用这两个方法，实在解决不了了才考虑使用apply进行操作。

## 3. Pandas教程 | Merge数据合并图文详解 https://zhuanlan.zhihu.com/p/102274476

经常需要将两张表拼接起来使用，这样的操作对应到SQL中是join，在Pandas中则是用merge来实现。这篇文章就讲一下merge的主要原理。

## 3.1 inner
merge的'inner'的类型称为内连接，它在拼接的过程中会取两张表的键（key）的交集进行拼接。

In [90]:
data1 = {'userid':["a","b",'c','d'], 'Age':[23,46, 32, 19]} #使用ndarary创建

df1 = pd.DataFrame(data1)

df1

  userid  Age
0      a   23
1      b   46
2      c   32
3      d   19

In [91]:
data2 = {'userid':["a",'c'], 'payment':[2000, 3500]} #使用ndarary创建

df2 = pd.DataFrame(data2)

df2

  userid  payment
0      a     2000
1      c     3500

In [92]:
df1.merge(df2,how='inner',on='userid')

  userid  Age  payment
0      a   23     2000
1      c   32     3500

In [ ]:
data3 = {'userid':["a",'c','a','b'], 'payment':[2000, 3500, 500, 1000]} #使用ndarary创建

df3 = pd.DataFrame(data3)

df3

In [94]:
df1.merge(df3,how='inner',on='userid')

  userid  Age  payment
0      a   23     2000
1      a   23      500
2      b   46     1000
3      c   32     3500

## 3.2 outer
'outer'是外连接，在拼接的过程中它会取两张表的键（key）的并集进行拼接。看文字不够直观，还是上例子吧！

In [100]:
data1 = {'userid':["a","b",'c','d'], 'Age':[23,46, 32, 19]} #使用ndarary创建

df1 = pd.DataFrame(data1)

df1

  userid  Age
0      a   23
1      b   46
2      c   32
3      d   19

In [101]:
data2 = {'userid':["a",'c','e'], 'payment':[2000, 3500,600]} #使用ndarary创建

df2 = pd.DataFrame(data2)

df2

  userid  payment
0      a     2000
1      c     3500
2      e      600

In [103]:
df1.merge(df2,how='outer',on='userid')

  userid   Age  payment
0      a  23.0   2000.0
1      b  46.0      NaN
2      c  32.0   3500.0
3      d  19.0      NaN
4      e   NaN    600.0

## 3.3 left 和right
'left'
merge时，以左边表格的键为基准进行配对，如果左边表格中的键在右边不存在，则用缺失值NaN填充。

'right'
merge时，以右边表格的键为基准进行配对，如果右边表格中的键在左边不存在，则用缺失值NaN填充。

In [95]:
data1 = {'userid':["a","b",'c','d'], 'Age':[23,46, 32, 19]} #使用ndarary创建

df1 = pd.DataFrame(data1)

df1

  userid  Age
0      a   23
1      b   46
2      c   32
3      d   19

In [96]:
data2 = {'userid':["a",'c','e'], 'payment':[2000, 3500,600]} #使用ndarary创建

df2 = pd.DataFrame(data2)

df2

  userid  payment
0      a     2000
1      c     3500
2      e      600

In [98]:
df1.merge(df2,how='left',on='userid')

  userid  Age  payment
0      a   23   2000.0
1      b   46      NaN
2      c   32   3500.0
3      d   19      NaN

In [99]:
df2.merge(df1,how='right',on='userid')

  userid  payment  Age
0      a   2000.0   23
1      b      NaN   46
2      c   3500.0   32
3      d      NaN   19

## 4. Pandas数据处理——盘点那些常用的函数（上）https://zhuanlan.zhihu.com/p/106722583

In [104]:
company=["A","B","C"]

data=pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
}
)
data

  company  salary  age
0       C      22   41
1       B      19   44
2       C      47   43
3       C      38   19
4       A      17   27
5       B      29   28
6       C      37   26
7       C      40   29
8       C      33   48
9       C      24   30

In [105]:
data.head()

  company  salary  age
0       C      22   41
1       B      19   44
2       C      47   43
3       C      38   19
4       A      17   27

In [106]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   company  10 non-null     object
 1   salary   10 non-null     int64
 2   age      10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

In [108]:
data.describe()

          salary        age
count  10.000000  10.000000
mean   30.600000  33.500000
std     9.991107   9.652288
min    17.000000  19.000000
25%    22.500000  27.250000
50%    31.000000  29.500000
75%    37.750000  42.500000
max    47.000000  48.000000

In [110]:
data['company'].value_counts()

C    7
B    2
A    1
Name: company, dtype: int64

In [111]:
data['company'].value_counts(normalize=True)

C    0.7
B    0.2
A    0.1
Name: company, dtype: float64

In [112]:
data['company'].value_counts(ascending=True)

A    1
B    2
C    7
Name: company, dtype: int64

In [113]:
data.isna()

   company  salary    age
0    False   False  False
1    False   False  False
2    False   False  False
3    False   False  False
4    False   False  False
5    False   False  False
6    False   False  False
7    False   False  False
8    False   False  False
9    False   False  False

In [114]:
data.isna().any()

company    False
salary     False
age        False
dtype: bool

In [115]:
data.dropna()

  company  salary  age
0       C      22   41
1       B      19   44
2       C      47   43
3       C      38   19
4       A      17   27
5       B      29   28
6       C      37   26
7       C      40   29
8       C      33   48
9       C      24   30

In [118]:
# data.fillna('B')
# # 用缺失值后面的值来填充（这里NaN后面是'A'）
#  data.fillna(method='bfill')

In [117]:
# 按索引降序排列
data.sort_index(ascending=False)

  company  salary  age
9       C      24   30
8       C      33   48
7       C      40   29
6       C      37   26
5       B      29   28
4       A      17   27
3       C      38   19
2       C      47   43
1       B      19   44
0       C      22   41

In [119]:
data.sort_values(by='salary')

  company  salary  age
4       A      17   27
1       B      19   44
0       C      22   41
9       C      24   30
5       B      29   28
8       C      33   48
6       C      37   26
3       C      38   19
7       C      40   29
2       C      47   43

## 5. Pandas数据处理——盘点那些常用的函数（下）https://zhuanlan.zhihu.com/p/106724730

In [125]:
data = {'company':['B',"A",'B','B','B', 'A','B','B','C'], 'gender':['Female','Female','Female','Female','Female','male','Female','Female','male'],
        'salary':[30,36,35,9,16,46,15,33,19], 'age':[40.0, 31.0, 28.0, 18.0, 43.0, 22.0, 28.0, 40.0, 32.0]} #使用ndarary创建

df = pd.DataFrame(data)

df

  company  gender  salary   age
0       B  Female      30  40.0
1       A  Female      36  31.0
2       B  Female      35  28.0
3       B  Female       9  18.0
4       B  Female      16  43.0
5       A    male      46  22.0
6       B  Female      15  28.0
7       B  Female      33  40.0
8       C    male      19  32.0

### 5.1 .astype()

In [127]:
# 把age字段转为int类型
df["age"] = df["age"].astype(int)
df

  company  gender  salary  age
0       B  Female      30   40
1       A  Female      36   31
2       B  Female      35   28
3       B  Female       9   18
4       B  Female      16   43
5       A    male      46   22
6       B  Female      15   28
7       B  Female      33   40
8       C    male      19   32

## 5.2 .rename()

将'age'更改为员工编号'number',并作用于原对象

In [130]:
df.rename(columns={'age':'number'},inplace=True)
df

  company  gender  salary  number
0       B  Female      30      40
1       A  Female      36      31
2       B  Female      35      28
3       B  Female       9      18
4       B  Female      16      43
5       A    male      46      22
6       B  Female      15      28
7       B  Female      33      40
8       C    male      19      32

## 5.3 .set_index()

In [131]:
df.set_index('number',inplace=True)
df

       company  gender  salary
number
40           B  Female      30
31           A  Female      36
28           B  Female      35
18           B  Female       9
43           B  Female      16
22           A    male      46
28           B  Female      15
40           B  Female      33
32           C    male      19

## 5.4 .reset_index()

drop = True，重置索引，并把原有的索引丢弃

In [133]:
df.reset_index(drop=True)

  company  gender  salary
0       B  Female      30
1       A  Female      36
2       B  Female      35
3       B  Female       9
4       B  Female      16
5       A    male      46
6       B  Female      15
7       B  Female      33
8       C    male      19

## ^^^还有好多

## 3. Pandas数据处理——玩转时间序列数据 https://zhuanlan.zhihu.com/p/106675563

datetime顾名思义就是既有日期date也有时间time，表示一个具体的时间点（时间戳）。timedelta则表示两个时间点之间的差，比如2020-01-01和2020-01-02之间的timedelta即为一天，相信并不难理解。

In [5]: data.trade_date.head()

Out[5]:

0    20190102

1    20190103

2    20190104

3    20190107

4    20190108

Name: trade_date, dtype: object

## 3.0 运用pd.to_datetime()，可以将对应的列转换为Pandas中的datetime64类型，便于后期的处理

In [11]: data["trade_date"] = pd.to_datetime(data.trade_date)

In [12]: data.trade_date.head()
    
Out[12]:
    
0   2019-01-02

1   2019-01-03

2   2019-01-04

3   2019-01-07

4   2019-01-08

Name: trade_date, dtype: datetime64[ns]

## 3.1 时间序列的索引

时间序列中索引和Pandas普通的索引类似，大多时候调用.loc[index,columns]进行相应的索引，直接上代码看看

In [20]: data1 = data.set_index("trade_date")

 2019年6月的数据

In [21]: data1.loc["2019-06"].head()
    
Out[21]:
                close       open       high        low
        
trade_date

2019-06-03  2890.0809  2901.7424  2920.8292  2875.9019

2019-06-04  2862.2803  2887.6405  2888.3861  2851.9728

2019-06-05  2861.4181  2882.9369  2888.7676  2858.5719

2019-06-06  2827.7978  2862.3327  2862.3327  2822.1853

2019-06-10  2852.1302  2833.0145  2861.1310  2824.3554

 2019年6月-2019年8月的数据

In [22]: data1.loc["2019-06":"2019-08"].tail()
    
Out[22]:
                close       open       high        low
        
trade_date

2019-08-26  2863.5673  2851.0158  2870.4939  2849.2381

2019-08-27  2902.1932  2879.5154  2919.6444  2879.4060

2019-08-28  2893.7564  2901.6267  2905.4354  2887.0115

2019-08-29  2890.9192  2895.9991  2898.6046  2878.5878

2019-08-30  2886.2365  2907.3825  2914.5767  2874.1028

## 3.2 提取出时间/日期的属性

当数据中的时间列（本数据中为trade_date列）已经转换为datetime64格式时，仅需调用.dt接口，即可快速求得想要的结果，下表中列出了.dt接口所提供的常见属性：

具体演示一下（下面仅显示2019-01-02的信息）：

一年中的第几天

In [13]: data.trade_date.dt.dayofweek[0]
    
Out[13]: 2

返回对应日期

In [14]: data.trade_date.dt.date[0]
    
Out[14]: datetime.date(2019, 1, 2)

返回周数

In [15]: data.trade_date.dt.weekofyear[0]
    
Out[15]: 1

返回周几

In [16]: data.trade_date.dt.weekday_name[0]
    
Out[16]: 'Wednesday'

## 3.3 resample

resample翻译过来是重采样的意思，官方文档中是这么描述resample的

resample() is a time-based groupby
翻译过来就是基于时间的groupby操作，我个人认为这是Pandas时间序列处理中最重要的功能，也是本文的重中之重。

### downsampling

以一个实例来引入，我们使用的数据是上证指数2019年的日级别数据，如果现在想求每季度的平均收盘价，应该怎么操作呢？

从日级别数据求季度级别数据，是从高频到低频的聚合操作，其实就类似于groupby按季度进行操作，用resample来写是这样子

In [32]: data.resample('Q',on='trade_date')["close"].mean()
    
Out[32]:
    
trade_date

2019-03-31    2792.941622

2019-06-30    3010.354672

2019-09-30    2923.136748

2019-12-31    2946.752270

Freq: Q-DEC, Name: close, dtype: float64

其中'Q'是以季度为频率进行采样，on指定datetime列（如果索引为Datetimeindex，则on不需要指定，默认依据索引进行降采样）

### upsampling

当采样的频率低于原有的频率时，即为升采样。升采样是对原有的时间粒度更为细粒度的划分，所以升采样时会产生缺失值。下面取2019-01-02至2019-01-03的数据按照6H的频率演示一下：

In [24]: example
    
Out[24]:
                close
        
trade_date

2019-01-02  2465.2910

2019-01-03  2464.3628

In [25]: example.resample('6H').asfreq()
    
Out[25]:
                         close
trade_date
2019-01-02 00:00:00  2465.2910
        
2019-01-02 06:00:00        NaN
        
2019-01-02 12:00:00        NaN
        
2019-01-02 18:00:00        NaN
        
2019-01-03 00:00:00  2464.3628

对resample后的结果应用.asfreq()会返回新频率下的结果。可以看到升采样后产生了缺失值。如果想要填充缺失值可以采用向后填充.bfill()或向前填充.ffill()的方式：

 向前填充，缺失值取2465.2910进行填充
    
In [29]: example.resample('6H').ffill()
    
Out[29]:
                         close
        
trade_date

2019-01-02 00:00:00  2465.2910
        
2019-01-02 06:00:00  2465.2910
        
2019-01-02 12:00:00  2465.2910
        
2019-01-02 18:00:00  2465.2910
        
2019-01-03 00:00:00  2464.3628

 向后填充，缺失值取2464.3628进行填充

In [30]: example.resample('6H').bfill()
    
Out[30]:
                         close
        
trade_date

2019-01-02 00:00:00  2465.2910
        
2019-01-02 06:00:00  2464.3628
        
2019-01-02 12:00:00  2464.3628
        
2019-01-02 18:00:00  2464.3628
        
2019-01-03 00:00:00  2464.3628

## 6. 天秀！Pandas还能用来写爬虫？https://zhuanlan.zhihu.com/p/122361747

谈及Pandas的read.xxx系列的函数，大家的第一反应会想到比较常用的pd.read_csv()和pd.read_excel()，大多数人估计没用过pd.read_html()这个函数。

## 7. 提高数据的颜值！一起看看Pandas中的那些Style https://zhuanlan.zhihu.com/p/126223075

## 8. 提速百倍的Pandas性能优化方法，让你的Pandas飞起来！https://zhuanlan.zhihu.com/p/97012199